; domain
; ==========================================================================
; Domain: Interplanetary Museum Vault (IMV) - Problem 1
;
; Single robotic curator, classical STRIPS-style planning
; ==========================================================================

(define (domain imv-transport)

  (:requirements :strips :typing :negative-preconditions)

  (:types
    item
    artifact pod - item
    robot location
  )

  (:predicates
    (at ?x - item ?l - location)               ; item x (artifact or pod) is at location l
    (robot-at ?r - robot ?l - location)         ; robot r is at location l
    (carrying ?r - robot ?x - item)             ; robot r is carrying item x (artifact or pod)
    (free ?r - robot)                           ; robot r is carrying nothing
    
    (tunnel-connected ?l1 - location ?l2 - location)      ; room <-> maintenance tunnel passage
    (tunnel-beta-connected ?l1 - location ?l2 - location) ; Hall beta (seismic) <-> maintenance tunnel passage

    (sealed ?r - robot)                         ; robot r has sealing mode active
    (seismic-active)                            ; a seismic event is currently active

    (in-pod ?a - artifact ?p - pod)             ; artifact a is currently secured inside pod p
    (is-fragile ?a - artifact)                  ; artifact a must be secured in a pod before being moved
    (is-alpha ?a - artifact)                    ; artifact a must be cooled and delivered to the cryo chamber
    (is-core-sample ?a - artifact)           ; artifact a is a martian core sample

    (stabilized ?a - artifact)                  ; artifact a has been secured in a pod
    (cooled ?a - artifact)                      ; artifact a has been cooled
  )

  ;; ---- movement. All rooms are reachable with the maintenance tunnel at the center of the map ------

  (:action move-via-tunnel
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from)
                        (tunnel-connected ?from ?to)
                        (sealed ?r))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  (:action move-via-tunnel-to-beta
    :parameters (?r - robot ?from - location ?to - location)
    :precondition (and (robot-at ?r ?from)
                        (tunnel-beta-connected ?from ?to)
                        (sealed ?r)
                        (not (seismic-active)))
    :effect (and (robot-at ?r ?to) (not (robot-at ?r ?from)))
  )

  ;; ---- sealing mode for maintenance tunnel crossing ---------------------

  (:action activate-sealing
    :parameters (?r - robot)
    :precondition (not (sealed ?r))
    :effect (sealed ?r)
  )

  (:action deactivate-sealing
    :parameters (?r - robot)
    :precondition (sealed ?r)
    :effect (not (sealed ?r))
  )

  ;; ---- handling pods -----

  (:action pickup-pod
    :parameters (?r - robot ?p - pod ?l - location)
    :precondition (and (robot-at ?r ?l) (at ?p ?l) (free ?r))
    :effect (and (carrying ?r ?p) (not (at ?p ?l)) (not (free ?r)))
  )

  (:action putdown-pod
    :parameters (?r - robot ?p - pod ?l - location)
    :precondition (and (robot-at ?r ?l) (carrying ?r ?p))
    :effect (and (at ?p ?l) (free ?r) (not (carrying ?r ?p)))
  )

  ;; ---- handling non-fragile artifacts directly -----

  (:action pickup-artifact
    :parameters (?r - robot ?a - artifact ?l - location)
    :precondition (and (robot-at ?r ?l) (at ?a ?l) (free ?r) (not (is-fragile ?a)))
    :effect (and (carrying ?r ?a) (not (at ?a ?l)) (not (free ?r)))
  )

  (:action putdown-artifact
    :parameters (?r - robot ?a - artifact ?l - location)
    :precondition (and (robot-at ?r ?l) (carrying ?r ?a))
    :effect (and (at ?a ?l) (free ?r) (not (carrying ?r ?a)))
  )

  ;; ---- handling fragile artifacts (must go inside a pod) ------
  ;; The robot has to be carrying a pod, travel to the artifact and load it in pod.

  (:action secure-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location)
    :precondition (and (robot-at ?r ?l) (carrying ?r ?p) (at ?a ?l) (is-fragile ?a))
    :effect (and (in-pod ?a ?p) (stabilized ?a) (not (at ?a ?l)))
  )

  (:action unload-from-pod
    :parameters (?r - robot ?a - artifact ?p - pod ?l - location)
    :precondition (and (robot-at ?r ?l) (carrying ?r ?p) (in-pod ?a ?p))
    :effect (and (at ?a ?l) (not (in-pod ?a ?p)))
  )

  ;; ---- handling alpha artifacts (must be cooled down) ------

  (:action cool
    :parameters (?r - robot ?a - artifact)
    :precondition (and (carrying ?r ?a) (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )

  ;; ---- handling fragile alpha artifacts (must be cooled down + put inside a pod) ------

  (:action cool-in-pod
    :parameters (?r - robot ?a - artifact ?p - pod)
    :precondition (and (carrying ?r ?p) (in-pod ?a ?p) (is-alpha ?a) (not (cooled ?a)))
    :effect (cooled ?a)
  )
)

; problem
(define (problem imv-transport-p1)
  (:domain imv-transport)

  (:objects
    curator1 - robot
    pod1 pod2 - pod
    art-beta-1                - artifact  ; common item (not fragile) from Hall beta
    art-beta-2                - artifact  ; fragile item from Hall beta
    art-alpha-1               - artifact  ; alpha item, not fragile
    art-alpha-2               - artifact  ; alpha item + fragile
    core-sample-1             - artifact  ; Martian Core Sample
    ;; map locations:
    entrance tunnel anti-vibration-pods hall-alpha hall-beta cryo-chamber stasis-lab - location
  )

  (:init
    ;; robot
    (robot-at curator1 entrance)
    (free curator1)

    ;; pods start stored in the Anti-Vibration Pods room
    (at pod1 anti-vibration-pods)
    (at pod2 anti-vibration-pods)

    ;; artifacts' initial locations
    (at art-beta-1 hall-beta)
    (at art-beta-2 hall-beta)
    (at art-alpha-1 hall-alpha)
    (at art-alpha-2 hall-alpha)
    (at core-sample-1 cryo-chamber)


    ;; artifact characteristics
    ;;false (is-fragile art-beta-1)) -> art-beta-1 is common artifact

    (is-fragile art-beta-2) ; art-beta-2 is fragile

    (is-alpha art-alpha-1)  ; art-alpha-1 only needs cooling

    (is-alpha art-alpha-2)
    (is-fragile art-alpha-2)          ; art-alpha-2 has both characteristics (fragile+cooling)

    (is-core-sample core-sample-1)



    ;; map topology from assignment image: every room hangs off the maintenance tunnel
    (tunnel-connected entrance tunnel)
    (tunnel-connected tunnel entrance)
    (tunnel-connected anti-vibration-pods tunnel)
    (tunnel-connected tunnel anti-vibration-pods)
    (tunnel-connected hall-alpha tunnel)
    (tunnel-connected tunnel hall-alpha)
    (tunnel-connected cryo-chamber tunnel)
    (tunnel-connected tunnel cryo-chamber)
    (tunnel-connected stasis-lab tunnel)
    (tunnel-connected tunnel stasis-lab)

    (tunnel-beta-connected hall-beta tunnel)
    (tunnel-beta-connected tunnel hall-beta)

    ;; map properties
    ;;((seismic-active))   ;; seismic activity false or the artifacts in beta can't be picked. Activate with time windows
  )

  (:goal
    (and
      ;; common artifact from Hall beta: secured in a pod, delivered to Stasis-Lab
      (at art-beta-1 stasis-lab)
      ;; fragile artifacts from Hall beta: secured in a pod, delivered to Stasis-Lab
      (stabilized art-beta-2) (at art-beta-2 stasis-lab)

      ;; alpha artifact (not fragile): cooled, delivered to the Cryo-Chamber
      (cooled art-alpha-1) (at art-alpha-1 cryo-chamber)

      ;; alpha artifact + fragile: secured in a pod, delivered to the Cryo-Chamber
      (stabilized art-alpha-2) (cooled art-alpha-2) (at art-alpha-2 cryo-chamber)

      ;; Martian Core Sample: relocated from the Cryo-Chamber to the Stasis-Lab
      (at core-sample-1 stasis-lab)
    )
  )
)

; plan
1. (activate-sealing curator1)
   added: (sealed curator1)
   goals met: 0 of 9
2. (move-via-tunnel curator1 entrance tunnel)
   deleted: (robot-at curator1 entrance)
   added: (robot-at curator1 tunnel)
   goals met: 0 of 9
3. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 0 of 9
4. (pickup-artifact curator1 art-alpha-1 hall-alpha)
   deleted: (at art-alpha-1 hall-alpha) (free curator1)
   added: (carrying curator1 art-alpha-1)
   goals met: 0 of 9
5. (cool curator1 art-alpha-1)
   added: (cooled art-alpha-1)
   goals met: 1 of 9
6. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 1 of 9
7. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 1 of 9
8. (putdown-artifact curator1 art-alpha-1 cryo-chamber)
   deleted: (carrying curator1 art-alpha-1)
   added: (at art-alpha-1 cryo-chamber) (free curator1)
   goals met: 2 of 9
9. (pickup-artifact curator1 core-sample-1 cryo-chamber)
   deleted: (at core-sample-1 cryo-chamber) (free curator1)
   added: (carrying curator1 core-sample-1)
   goals met: 2 of 9
10. (move-via-tunnel curator1 cryo-chamber tunnel)
   deleted: (robot-at curator1 cryo-chamber)
   added: (robot-at curator1 tunnel)
   goals met: 2 of 9
11. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 2 of 9
12. (putdown-artifact curator1 core-sample-1 stasis-lab)
   deleted: (carrying curator1 core-sample-1)
   added: (at core-sample-1 stasis-lab) (free curator1)
   goals met: 3 of 9
13. (move-via-tunnel curator1 stasis-lab tunnel)
   deleted: (robot-at curator1 stasis-lab)
   added: (robot-at curator1 tunnel)
   goals met: 3 of 9
14. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 3 of 9
15. (pickup-artifact curator1 art-beta-1 hall-beta)
   deleted: (at art-beta-1 hall-beta) (free curator1)
   added: (carrying curator1 art-beta-1)
   goals met: 3 of 9
16. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 3 of 9
17. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 3 of 9
18. (putdown-artifact curator1 art-beta-1 stasis-lab)
   deleted: (carrying curator1 art-beta-1)
   added: (at art-beta-1 stasis-lab) (free curator1)
   goals met: 4 of 9
19. (move-via-tunnel curator1 stasis-lab tunnel)
   deleted: (robot-at curator1 stasis-lab)
   added: (robot-at curator1 tunnel)
   goals met: 4 of 9
20. (move-via-tunnel curator1 tunnel anti-vibration-pods)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 anti-vibration-pods)
   goals met: 4 of 9
21. (pickup-pod curator1 pod1 anti-vibration-pods)
   deleted: (at pod1 anti-vibration-pods) (free curator1)
   added: (carrying curator1 pod1)
   goals met: 4 of 9
22. (move-via-tunnel curator1 anti-vibration-pods tunnel)
   deleted: (robot-at curator1 anti-vibration-pods)
   added: (robot-at curator1 tunnel)
   goals met: 4 of 9
23. (move-via-tunnel curator1 tunnel hall-alpha)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-alpha)
   goals met: 4 of 9
24. (secure-in-pod curator1 art-alpha-2 pod1 hall-alpha)
   deleted: (at art-alpha-2 hall-alpha)
   added: (in-pod art-alpha-2 pod1) (stabilized art-alpha-2)
   goals met: 5 of 9
25. (move-via-tunnel curator1 hall-alpha tunnel)
   deleted: (robot-at curator1 hall-alpha)
   added: (robot-at curator1 tunnel)
   goals met: 5 of 9
26. (cool-in-pod curator1 art-alpha-2 pod1)
   added: (cooled art-alpha-2)
   goals met: 6 of 9
27. (move-via-tunnel curator1 tunnel cryo-chamber)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 cryo-chamber)
   goals met: 6 of 9
28. (unload-from-pod curator1 art-alpha-2 pod1 cryo-chamber)
   deleted: (in-pod art-alpha-2 pod1)
   added: (at art-alpha-2 cryo-chamber)
   goals met: 7 of 9
29. (move-via-tunnel curator1 cryo-chamber tunnel)
   deleted: (robot-at curator1 cryo-chamber)
   added: (robot-at curator1 tunnel)
   goals met: 7 of 9
30. (move-via-tunnel-to-beta curator1 tunnel hall-beta)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 hall-beta)
   goals met: 7 of 9
31. (secure-in-pod curator1 art-beta-2 pod1 hall-beta)
   deleted: (at art-beta-2 hall-beta)
   added: (in-pod art-beta-2 pod1) (stabilized art-beta-2)
   goals met: 8 of 9
32. (move-via-tunnel-to-beta curator1 hall-beta tunnel)
   deleted: (robot-at curator1 hall-beta)
   added: (robot-at curator1 tunnel)
   goals met: 8 of 9
33. (move-via-tunnel curator1 tunnel stasis-lab)
   deleted: (robot-at curator1 tunnel)
   added: (robot-at curator1 stasis-lab)
   goals met: 8 of 9
34. (unload-from-pod curator1 art-beta-2 pod1 stasis-lab)
   deleted: (in-pod art-beta-2 pod1)
   added: (at art-beta-2 stasis-lab)
   goals met: 9 of 9
